<template>
    <!-- 分层纵向柱状图（barxClass） -->
    <div class="echarts-dom" ref="echart"></div>
</template>

<script>
export default {
    mounted() {
        // 【模拟数据】
        let data = [
            {
                name: '2016',
                series: [
                    { name: '平遥古镇', data: [82.3, 66.39, 63.0, 72.75, 87.3, 79.3, 84.14, 62.7, 75.29, 86.34, 57.4, 55.93] },
                    { name: '乔家大院', data: [38.35, 42.9, 41.24, 52.8, 55.3, 44.91, 39.14, 37.19, 38.91, 49.13, 45.71, 46.95] },
                    { name: '五台山', data: [69.28, 64.72, 64.0, 48.12, 55.28, 42.2, 51.9, 46.7, 48.81, 46.7, 38.01, 24.48] },
                    { name: '壶口瀑布', data: [26.13, 24.81, 27.16, 30.0, 39.78, 62.89, 71.2, 70.87, 52.78, 48.2, 31.28, 27.12] }
                ],
                xAxis: ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月']
            },
            {
                name: '2017',
                series: [
                    { name: '平遥古镇', data: [82.3, 66.39, 63.0, 62.7, 75.29, 86.34, 72.75, 87.3, 79.3, 84.14, 57.4, 55.93] },
                    { name: '乔家大院', data: [39.14, 37.19, 38.91, 49.13, 45.71, 38.35, 42.9, 41.24, 52.8, 55.3, 44.91, 46.95] },
                    { name: '五台山', data: [69.28, 64.72, 46.7, 48.81, 46.7, 64.0, 48.12, 55.28, 42.2, 51.9, 38.01, 24.48] },
                    { name: '壶口瀑布', data: [26.13, 24.81, 27.16, 71.2, 70.87, 52.78, 48.2, 30.0, 39.78, 62.89, 31.28, 27.12] }
                ],
                xAxis: ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月']
            }
        ];

        // 【图表配置】
        this.$dispatch('barxClass', {
            data: {
                data: data,
                isTimeline: true // 是否开启时间轴
            },
            opt: {
                tooltip: {
                    formatter: param => {
                        let res = `${param[0].name}<br>`;
                        param.map(item => {
                            res += `${item.seriesName} : ${item.value}<br>`;
                        });
                        return res;
                    }
                }
            }
        }).then(res => {
            let dom = this.$refs.echart;
            let echart = this.$echart(dom, res.opt); // echart.instance 图表实例
        });
    }
};
</script>
